[{"review":"This is an epic of all time. A mythological one that blewed everyone off. The war secens are breathtaking that creates curiosity and anxiety amongst the spectators. The  protagonist were tremendous, played their roles as if they were professionals. It was a fun loving movie filled with excitement,drama, romance, aggression and much such emotions. It purely showcase the hard work and dedication put up by these actors, director, the script writer ....    \nOverall this movie is awesome 👌🙌 no one  ...MORE","label":0},{"review":"This is an epic of all time. A mythological one that blewed everyone off. The war secens are breathtaking that creates curiosity and anxiety amongst the spectators. The  protagonist were tremendous, played their roles as if they were professionals. It was a fun loving movie filled with excitement,drama, romance, aggression and much such emotions. It purely showcase the hard work and dedication put up by these actors, director, the script writer ....    \nOverall this movie is awesome 👌🙌 no one can match up to it's excellence 🤩\nI honestly recommend people to watch it \nLove you cast of Bahubali 😍❣️❣️❣️","label":0},{"review":"Great movie, but the main character is sort of misogynistic, he taunts his lover upon meeting her for the first time without properly explaining anything. His lover, an incredibly strong warrior and who truly defines representing feminine power within South Asian culture, is immediately demoted following his appearance. To show she's pretty, he strips her, puts makeup on her, and then the movie don't give her another fight scene. \nAlso, it highly employs colorism. She's immediately whiter when a ...MORE","label":0},{"review":"Great movie, but the main character is sort of misogynistic, he taunts his lover upon meeting her for the first time without properly explaining anything. His lover, an incredibly strong warrior and who truly defines representing feminine power within South Asian culture, is immediately demoted following his appearance. To show she's pretty, he strips her, puts makeup on her, and then the movie don't give her another fight scene. \nAlso, it highly employs colorism. She's immediately whiter when acting pretty and then her skin becomes darker when she puts clothes on. The opposing army and antagonists are dark skinned, greatly contrasting the lighter skinned protagonists. In every climatic scene for the protagonist, his skin is visibly lightened.\nOtherwise, the movie is really good. Since South Asian culture usually uses this tropes, it's in line with what's expected. Would love to see less of this in such a beautiful and complex story.","label":0},{"review":"You should watch this movie by giving your logical mind a backseat. It is a movie meant to be  enjoyed at its fullest. Great visuals, terrific BGMs, awesome acting, all at epic scales. This film has created a new era in the history of Indian cinema. It's so amazing that it can be watched again and again even after watching its conclusion.","label":0},{"review":"AHHH! Telegu movies at its height of popularity and greatness! This movie was fantastic. It was violent, somewhat inappropriate, but all for the right reasons! Compelling characters, clear focus. You cared for the characters and the emotion does not feel forced. You understood the stories of Mahendra and Amarendra Bahubali. I wished I got to see them together tho. Rana Dagupatti was a legend! The casting choices for Bhallaladeva was awesome. You felt the weight of the Mahishmathi Empire and it i ...MORE","label":0},{"review":"AHHH! Telegu movies at its height of popularity and greatness! This movie was fantastic. It was violent, somewhat inappropriate, but all for the right reasons! Compelling characters, clear focus. You cared for the characters and the emotion does not feel forced. You understood the stories of Mahendra and Amarendra Bahubali. I wished I got to see them together tho. Rana Dagupatti was a legend! The casting choices for Bhallaladeva was awesome. You felt the weight of the Mahishmathi Empire and it is all under the rule of a vicious, cruel beast. There is a clear tone. I had such a fun time with this film. Good use of scenery and the part where he fights Bhadra was pretty awesome. Although I do believe Bahubali 2 was better, this was a great film! \n\n9.5/10","label":0},{"review":"Best movie ever...... The series of Baahubali must be continued and it will surely be a tough match for Hollywood.\nThis is awesome 100%. It has many elements of fantasy, immersive story, plotline superb graphics, vfx, etc.... must watch\nThanks Prabhas , SS Rajamouli, and team....\nI m waiting for BAAHUBALI 3!","label":0},{"review":"This movie has carved a niche in the world of Indian cinema and has made realised the western counterparts about how much Indian film industries has developed to match the Hollywood movies.And the credit goes to its phenomenal director S.S. Rajamouli and his team who has worked tremendously for years to create this historic epic.keep it sir.👍👍👍👍","label":0},{"review":"This is the best movie I have ever seen. People must watch this movie.salute to entire Bahubali team.As an Indian I'm feeling proud for the huge success of BAHUBALI:THE BEGINNING and BAHUBALI :THE CONCLUSION. Every scene of this film is awesome. Love this movie forever.","label":0},{"review":"The best movie in the history of Indian cinema!! Bahubali has set a benchmark for the makers of historical films and Salute to you Sir S.S Rajamouli for reviving our wonderful Indian culture once again. Outstanding work by everyone. Thumbsup!","label":0},{"review":"Its a very good movie and a strong competition to the Hollywood  movies, plot, story and vfx were out  of the mark and really very outstanding and prabhas is really my hero, he's my man. 10/10  for this movie really love this. \n            spend 560 for 1 ticket but no regret","label":0},{"review":"I have seen this movie 4 times.  and it is one of the best movies that i have recently seen. The graphics highlighted the essence of movie. And ultimately the rebel star PRABHAS fans had a feast. No indian movie can replace this epic and an unbeatable collections at box office.","label":0},{"review":"The starter. Amar chitra katha and fairy tales get Tollywood treatment. I wasn't expecting much before watching it. In theater only, my opinion about this Movie gradually changed. Amazing movie.\nP.S.: Do not even try to apply Newton's physics or science or any logic to this movie. Just savor it.","label":0},{"review":"In today’s Indian cinema, which has acquired so much western and modern elements with time, this movie truly is remarkable in the sense that it truly reflects our culture, the vedic culture , and signifies the verse यतो धर्मस्ततो जय. Kind of like a mahabharat. Wish we could see more of such beautiful movies in Indian cinema.","label":0},{"review":"The best film of the Indian film industries and S.S Rajamouli. Baahubali is a greatest film I ever saw. The story, music, performances, direction, and the budget is really big positives of the movie. There is only 1 negative in the film and that is the predictability but overall a big blockbuster of S.S Rajamouli and Prabhas. Everyone would love Baahubali","label":0},{"review":"Movie is good for Indian audience who had not watched Hollywood movies. Has Indian I like this movie.but has movie lover I had not satisfied because nothing is new in this movie they had copyed so many scenes from English movies. this movies is COPY CAT of all Hollywood movies like 1.Hercules, \n2.300,\n3.TROY,\n4. Lord of Rings 1,2,3,4....\n5.Gladiator, \n6.Conan the barbarian, \n7.Conan the Destroyer, \netc\n   And many more Hollywood movies....","label":0},{"review":"A movie of huge budget was made to showcase the skills of SS Raja Mauli which had a strong star cast from the southern India's film industry. Big names like Prabhas, Rana Duggubati, Anushka Shetty & Tamannah Bhatia were roped in in the main characters. Prabhas plays Bahubali, Rana plays the character of Bhallal Dev & Anushka plays the character of Dev Sena.. The love story also shows how greed can make own people corrupt. The way story was narrated was completely new & special effects were of in ...MORE","label":0},{"review":"A movie of huge budget was made to showcase the skills of SS Raja Mauli which had a strong star cast from the southern India's film industry. Big names like Prabhas, Rana Duggubati, Anushka Shetty & Tamannah Bhatia were roped in in the main characters. Prabhas plays Bahubali, Rana plays the character of Bhallal Dev & Anushka plays the character of Dev Sena.. The love story also shows how greed can make own people corrupt. The way story was narrated was completely new & special effects were of international standards.","label":0},{"review":"Amazing Movie. If you are looking for entertainment and serious storyline both at the same time,with a great historical theme.This is definately the movie for you. One of the best movies the world has ever seen.","label":0},{"review":"Excellent movie... Prabhas is brilliant. Tamannaah as Avanthika is good. She was looking so beautiful and gorgeous in the two songs- Dheevara and Panchhi Bole. Rana as Bhallaladeva is great. Bgm is fantastic, VFX is amazing. Hats off S.S. Rajamouli sir.\nJAI MAHISHMATI","label":0},{"review":"It's a marvelous experience watching the Bahubali series. Think Big and Bigger than the Screen are the words, we can give to the Director Shri. Rajamouli. The movie that made Indian films especially Telugu movie to a great height in the history of World cinema.","label":0},{"review":"This movie is indeed a great one . The third part of movie is if the director will bring most be a marvelous one. The artist of this movie are fentastic.They deserve to be praise. I would certainly thanks to the founder of this movie .","label":0},{"review":"BAAHUBALI... is the greatest movie i ever seen. This is a all time mega hit movie. The Characters of this movies are well executed. Specialy Pravash. I think he is born for this movie. Well Directed by Ram moli. Great movie","label":0},{"review":"This movie has set some great standards in film industry. The making of the movie shows the art of direction . The actors were the perfect fit for the roles. What makes you feel nostalgic of ancient indian emperical environment.","label":0},{"review":"Epic.... This is the masterpiece of Rajamouli sir. Loved Baahubali series to the core. A bow to Prabhas,  Rana, Anushka, Rajamouli, Keeravani and the whole cast and crew for such a magnum opus movie... This movie remains in the Indian history forever.","label":0},{"review":"One of the best movie I watched ever. It will take you to the old world of King and you will not think anything else other than its story till the movie ends. Awesome work by s.s Rajamouli.","label":0},{"review":"Best movie forever.Super story super theme & mind blowing action. Prabhas is a verry good actor. Famous Katappa mama overflow all. It such a good flim. Jay Mahismati.....","label":0},{"review":"It was overall a great movie, but there was a bit too much violence. The action and stunts were amazingly choreographed, hats off to director and the production manager, true story but some made up stuff, Great acting!","label":0}]