[{"review":"This movie is a great way to get family back together. \nIt is a gorgeous gift to entire audience from Bollywood. \nIt beholds the most charming and dashing actors of all time,especially saif Ali Khan and mohnish in lead roles.\nScreen presence of Salman is very less .\nI love the entire movie and have watched it 20 times.\nAfter watching it I became a die hard fan of Saif and his mind blowing acting. \nI will recommend everyone who is reading this please do watch this heartwarming story about a mothe ...MORE","label":0},{"review":"This movie is a great way to get family back together. \nIt is a gorgeous gift to entire audience from Bollywood. \nIt beholds the most charming and dashing actors of all time,especially saif Ali Khan and mohnish in lead roles.\nScreen presence of Salman is very less .\nI love the entire movie and have watched it 20 times.\nAfter watching it I became a die hard fan of Saif and his mind blowing acting. \nI will recommend everyone who is reading this please do watch this heartwarming story about a mother who has to send his son away due to her evil friends who poisoned her mind \nIt is an awesome movie please do watch.","label":0},{"review":"When I first saw HSSH, I think Salman is the lead actor in this film, but after watching whole movie, I saw Saif Ali Khan and Mohnish Behl are the lead actors of this movie.\n\nIf Salman Khan is the Prem of \"HAHK\", then  Saif Ali Khan is the Prem of \"HSSH\".\n\nSAIF got more screen presence than Salman in this movie and also dethrones him in acting terms.\nAlso his chemistry with Karishma is very beautiful and endearing.\n\nSalman got screen space only in the last when he conftonts his mother, otherwise ...MORE","label":0},{"review":"When I first saw HSSH, I think Salman is the lead actor in this film, but after watching whole movie, I saw Saif Ali Khan and Mohnish Behl are the lead actors of this movie.\n\nIf Salman Khan is the Prem of \"HAHK\", then  Saif Ali Khan is the Prem of \"HSSH\".\n\nSAIF got more screen presence than Salman in this movie and also dethrones him in acting terms.\nAlso his chemistry with Karishma is very beautiful and endearing.\n\nSalman got screen space only in the last when he conftonts his mother, otherwise in whole movie he is just a Supporting Actor like others in this multi starrer.\nIn actresses All are good in their own ways.\nRest of cast are good!!!\nAlok nath, Reema, Neelam, Shakti Kapoor all are good!!!\nMusic is good but will be better as the movie comes in late 90's, so expectations are high.\n\nWatch it if you are Saif's fan, Salman fans may disappointed.\nFamily audiences can love this film.","label":0},{"review":"I love this movie. This movie you can watch with your whole family 👨‍👩‍👧‍👦. The best part of movie they are showing there village , the scene I watch many times. \nI know that how many times I watch maximum 19 time.  I download movie in my phone,  I have DVD also. Even my rest of life I watch this movie. I remember all the 7 song of this  movie. I won't to know the child artist play the role of Salman khan, sonali bendre,  mohnish behal,  neelam kothari,  karishma kapoor,  saif ali khan,  I w ...MORE","label":0},{"review":"I love this movie. This movie you can watch with your whole family 👨‍👩‍👧‍👦. The best part of movie they are showing there village , the scene I watch many times. \nI know that how many times I watch maximum 19 time.  I download movie in my phone,  I have DVD also. Even my rest of life I watch this movie. I remember all the 7 song of this  movie. I won't to know the child artist play the role of Salman khan, sonali bendre,  mohnish behal,  neelam kothari,  karishma kapoor,  saif ali khan,  I want to see there adult photo & also the pic of raju, bablu.. \nPlz upload on google \nJust watch the movie. You loved it💕💕❤😍😍😘","label":0},{"review":"I'm watch this movie only for Saif Ali Khan as Vinod\nHe is looking so charming and loving in the 90's and also in this movie.\nAfter that it is Mohnish Behl who after HAHK, gave another solid performance.\nSonali Bendre looking very cute and adorable as Preeti so as Karishma Kapoor and Tabu.\nThe rest of Cast including Salman gave good support to the movie.\nThe Music is plus point of this Family Drama.\nAll songs all cult classics.","label":0},{"review":"This movie is one of my favourite movies of all time. The movie has Family , Romance and Beautiful music. \n\nEven though there are criticism on how the actors/actresses do not have a lot of lines, i feel that the movie's plot complements the characters through the movie.\n\nOverall, one of the best movies for me :)","label":0},{"review":"The movie is all about family .In the family the situation more complicated but the best part of the movie is the acting of all character is outstanding.\nI recognize you to watch movie if you love your family . I love that part of movie when they showing their village, there old memories ❤. Song of movie is awesome 😙😙I can say that I remember all the song of movie.plz guys watch the movie with your all emotions 😊.After watching the movie you love it 😙❤😊😄","label":0},{"review":"Hum saath saath hain is my favourite movie ,because it is a rajshri film production and all the actors are famous like Tabu,Sonali Bindre , Karishma Kapoor , Salman Khan ,Saif ali khan acted so well . The story line is awesome, bonding between all brothers and their love for mother is clearly shown in the movie.I have watched this movie more than 8 times,The chemistry of sonali and salman is awesome , I overall rate  4.8/5.","label":0},{"review":"Watch it many times, one of the best movie with great music and great performance by all cast. It feels nostalgic about family values, childhood, love, simplicity of joint indian family. Dedication and love for your family. A must watch with full family.","label":0},{"review":"The movie is awesome. It helps us to be united in all the circumstances and help each other in every aspect of life and teaches that the soul of the family is one .The holy faith in God and if a faimly is united in all aspects then know one can divide  us ..i really loved the movie ..","label":0},{"review":"World best movie forever. This is Evergreen movie.I love familial movie. This movie teaches us that we should be together in every condition of life because Union is strength. 1 and 1 doesn't  two rather 1 and 1 eleven.","label":0},{"review":"MOVE HUM SATH  SATH HAINTON IS A GOOD AND GOOD  COMMEDI. ALL ACTOR PLAYS WELL AND CHOREOGRAPHY IS ALSO GOOD WITH GOOD DIRECTION. OVER ALL GOOD SOCIAL PICTURE.AS MY OPINION IS THIS RAITING  FIVE STAR. LALIT KUMAR VYAS KASYAP RETIRED ENGINEER FROM JODHPUR DISCOM JODHPUR","label":0},{"review":"I Like this movie very much because in these days there should be good relation between parents and children and between brothers and sisters. I watched this movie many times and i want to live with joint family with parents and brothers and children.  Because they know the importance of Grand Father, Grand Mother and Uncles and Aunts.","label":0},{"review":"I love this movie . This movie creat a bond of love. My favourite hero is salman Khan.l have watched this moview 30 times and my favourite song is, \" ye to Sach h ki bhag van h\".","label":0},{"review":"I have no idea how much time I had seen this movie, this movie show great indian values,tradition,love between family members, it is the best ever example of family movie....I cry each n every time after watching this movie, this movie have great direction,storyline, and great acting of actors...... heart touching movie💘\nI will rate 4.9/5","label":0},{"review":"One of the best movie I have ever seen. Such a beautiful movie, in this year 2019 this movie was completed its 20 years but I think that people still love this movie so much and watch this movie several times.","label":0},{"review":"I love this movie. This movie you can watch with your whole family 👨‍👩‍👧‍👦. The best part of movie they are showing there village , the scene I watch many times.","label":0},{"review":"It is a superb movie. Good songs, nice family entertainer. It is a must watch movie. Salmaan Khan and Sonali Bendre Jodi is very awesome. Tabu is acted very well. Totally it is a watchable movie","label":0},{"review":"This movie is very good .I never miss it when it comes in tv  yrr .it's to amazing to watch this movie.  Like the love of salman and sonali","label":0},{"review":"Every time I used to ignore this movie whenever it has been shown in television but today I watched it and thinking about it continuously... one of the Best movie I have ever seen..","label":0},{"review":"Film was very good and motivational as Anuj Prakash sir had told that the lead role was of saif I am not agree wid his decision coz the lead role is of mohsin bahl and Salman khan saif is just for entertaining just bcoz of he's the smallest one and naughty.","label":0},{"review":"Gorgeous movie \nThe Second Best Movie in 90s History\nI cried a lot waiting this legendary Movie.\nAnd Salman Khan Awesome Acting\nThank you so much Salman Sir","label":0},{"review":"THIS IS MY ALL TIME FAVORITE MOVIE BECAUSE WE HAVE TO STAND UNITED WITH OUR PARENTS AND BROTHERS AND SISTERS AND WHEN WE SEEPED IN TO NEW HOME WE SHOULD NOT DIVIDE THE HOUSE.  WE LOVE EACH AND EVERY FAMILY MEMBER.","label":0},{"review":"Excellent movie \nNow-a-days we cannot see such type of family relation everyboby is busy in there own work this is a inspring film from all other flim","label":0},{"review":"My childhood Memories are attached in this movie... \nMy family is one of them. I grew up also in this environment and bonding.  Thanks to Director: ( Sooraj Barjatya ) for this evergreen movie.","label":0},{"review":"This movie was very brilliant with brilliant cast especially the chemistry of saif and karishma's  was really very good but the prem (salman) was very shy in this film but this role is very appreciative to his goodness and fans","label":0}]